//  2. Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt

// ++++++++++++++++++++++++++++++++++++++++++++++++++
// let inputValue;
// do {
//   inputValue = prompt('Enter number more then 100');
// } while (inputValue < 100 && inputValue);

// or ++++++++++++++++++++++++++++++++++++++++++++++++++
// let inputValue = prompt("Enter number more then 100");

// while (inputValue < 100 && inputValue) {
//   inputValue = prompt("Enter number more then 100");
// }

// console.log(inputValue || 'Error');

// =========================================
// 3. Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

// const url = "https://my-site.com/about";

// +++++++++++++++++++++++++++++++++++++++++
// function checkUrl(url) {
//   if (url.includes("my-site") && !url.endsWith("/")) {
//     return `${url}/`;
//   }
//   return url;
// }

// console.log(checkUrl(url));
// ===================================
